cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'coreutils'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'spark'
brew 'unrar'
brew 'jq'
brew 'gist'
brew 'imgur-screenshot'
brew 'tmux'

# from https://github.com/mathiasbynens/dotfiles/blob/master/brew.sh
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed', args: ['with-default-names']

brew 'vim', args: ['override-system-vi']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'

brew 'dark-mode'
brew 'git'
brew 'git-lfs'
brew 'lua'
brew 'lynx'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'tree'

cask 'google-chrome'
cask 'vlc'

# quick look plugins from https://github.com/donnemartin/dev-setup/blob/master/brew.sh
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'

# bitbar installation https://github.com/matryer/bitbar
# cask 'bitbar'
