cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spark'
brew 'unrar'
brew 'youtube-dl'
brew 'jq'
brew 'gist'
brew 'imgur-screenshot'

# from https://github.com/mathiasbynens/dotfiles/blob/master/brew.sh
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed', args: ['with-default-names']

brew 'vim', args: ['override-system-vi']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'

tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

brew 'dark-mode'
brew 'git'
brew 'git-lfs'
brew 'lua'
brew 'lynx'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'rhino'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'tree'
brew 'webkit2png'
brew 'zopfli'

cask 'atom'
cask 'google-chrome'
cask 'slack'
cask 'vlc'

# quick look plugins from https://github.com/donnemartin/dev-setup/blob/master/brew.sh
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'

# bitbar installation https://github.com/matryer/bitbar
cask 'bitbar'
